In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
dataset=pd.read_csv("train_u6lujuX_CVtuZ9i.txt")

In [3]:
dataset.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [4]:
dataset.columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [5]:
dataset.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [6]:
dataset['Dependents'].isnull().sum()

15

In [7]:
dataset['Dependents'].value_counts()

0     345
1     102
2     101
3+     51
Name: Dependents, dtype: int64

In [8]:
dataset['Dependents']=dataset['Dependents'].replace(np.nan,0)

In [9]:
dataset['Dependents'].isnull().sum()

0

In [10]:
dataset['Dependents'].value_counts()

0     345
1     102
2     101
3+     51
0      15
Name: Dependents, dtype: int64

In [11]:
dataset['Dependents']=dataset['Dependents'].replace("3+",3)

In [12]:
dataset['Self_Employed'].value_counts()

No     500
Yes     82
Name: Self_Employed, dtype: int64

In [13]:
dataset['Self_Employed']=dataset['Self_Employed'].replace(np.nan,"No")

In [14]:
dataset['Self_Employed'].value_counts()

No     532
Yes     82
Name: Self_Employed, dtype: int64

In [15]:
dataset['LoanAmount']=dataset['LoanAmount'].replace(np.nan,dataset['LoanAmount'].mean())

In [16]:
dataset['LoanAmount'].isnull().sum()

0

In [17]:
dataset['Loan_Amount_Term']=dataset['Loan_Amount_Term'].replace(np.nan,360)

In [18]:
dataset['Loan_Amount_Term'].isnull().sum()

0

In [19]:
dataset.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,146.412162,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.000000,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.000000,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.000000,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.000000,360.0,1.0,Urban,Y

In [20]:
dataset['Education'].value_counts()

Graduate        480
Not Graduate    134
Name: Education, dtype: int64

In [21]:
def part(x):
    if x=="Graduate":
        return 1
    else:
        return 0

In [22]:
dataset['Education']=dataset['Education'].map( part)

In [23]:
def part1(x1):
    if x1=="No":
        return 0
    else:
        return 1

In [24]:
dataset['Self_Employed']=dataset['Self_Employed'].map(part1)

In [25]:
X=dataset.iloc[:,[3,4,5,6,7,8,9,11]]

In [26]:
y=dataset.iloc[:,-1]

In [27]:
X.head()

,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Property_Area
0,0,1,0,5849,0.0,146.412162,360.0,Urban
1,1,1,0,4583,1508.0,128.000000,360.0,Rural
2,0,1,1,3000,0.0,66.000000,360.0,Urban
3,0,0,0,2583,2358.0,120.000000,360.0,Urban
4,0,1,0,6000,0.0,141.000000,360.0,Urban

In [28]:
X=X.values
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
labelencoder_X = LabelEncoder()
X[:, 7] = labelencoder_X.fit_transform(X[:, 7])
onehotencoder = OneHotEncoder(categorical_features = [7])
X = onehotencoder.fit_transform(X).toarray()

In [29]:
X.shape

(614, 10)

In [30]:
X=X[:,1:]

In [31]:
from sklearn.naive_bayes import GaussianNB
classifier = GaussianNB()
classifier.fit(X, y)

GaussianNB(priors=None)

In [38]:
test=pd.read_csv("test.csv",index_col=0)

In [40]:
type(test)

pandas.core.frame.DataFrame

In [41]:
test=test.values

In [42]:
y_pred=classifier.predict(test)

In [44]:
y_pred.shape

(367,)

In [45]:
type(y_pred)

numpy.ndarray

In [46]:
df=pd.DataFrame(y_pred)

In [55]:
sample=pd.read_csv("sample_submission_S7jWYrJ.csv")

In [57]:
sample['Loan_Status']=df.iloc[:,0]

In [59]:
type(sample)

pandas.core.frame.DataFrame

In [60]:
sample.to_csv("sample_submission.csv")